// Число для якого генеруємо таблицю множення
const number = 5;
 
// Цикл for
// i починається з 1 і збільшується на 1 до 10 включно
for (let i = 1; i <= 10; i++) {
  // Формуємо рядок таблиці множення
  const result = `${number} x ${i} = ${number * i}`;
  // Виводимо рядок в консоль
  console.log(result);
}
 
// Цикл while
// Оголошуємо лічильник перед циклом
let i = 1;
while (i <= 10) {
  // Формуємо рядок таблиці множення
  const result = `${number} x ${i} = ${number * i}`;
  // Виводимо рядок в консоль
  console.log(result);
  // Збільшуємо лічильник на 1, щоб уникнути нескінченного циклу
  i++;
}